; domain
(define (domain the_game)
    (:requirements :strips :typing :fluents :negative-preconditions :disjunctive-preconditions :conditional-effects)

    (:types 
        pile card - object
    )

    (:predicates
        (ascending_pile ?p - pile)
        (descending_pile ?p - pile)
        (card_in_hand ?c - card)
        (top_pile_card ?p - pile ?c - card)
        (next_card_in_deck ?c1 - card ?c2 - card)  ; Simulates list order in drawing pile
        (top_deck_card ?c - card)
        (is_drawing)
        (is_bottom_card ?c - card)
        (deck_empty)
    )

    (:functions
        (value ?c - card)
        (n_card_in_hand) 
    )

    (:action play_card
        :parameters (?c - card ?p - pile ?c_top - card)
        :precondition (and
            (card_in_hand ?c) 
            (top_pile_card ?p ?c_top) 
            (not (is_drawing))
            (or 
                (and (ascending_pile ?p) (> (value ?c) (value ?c_top)))
                (and (descending_pile ?p) (< (value ?c) (value ?c_top)))
                (and (ascending_pile ?p) (= (value ?c) (- (value ?c_top) 5)))
                (and (descending_pile ?p) (= (value ?c) (+ (value ?c_top) 5)))
            )
        )
        :effect (and
            (not (card_in_hand ?c))
            (top_pile_card ?p ?c)
            (not (top_pile_card ?p ?c_top))
            (decrease (n_card_in_hand) 1)

        )
    )

    (:action draw_card
        :parameters (?c1 - card ?c2 - card)
        :precondition (and
            (top_deck_card ?c1)
            (next_card_in_deck ?c1 ?c2)
            (<= (n_card_in_hand) 6)
            (or 
                (is_drawing)
                (<= (n_card_in_hand) 5)
            )
        )
        :effect (and
            (not (top_deck_card ?c1))
            (top_deck_card ?c2)
            (card_in_hand ?c1)
            (increase (n_card_in_hand) 1)
            (is_drawing)
        )
    )
    
    (:action stop_drawing
        :parameters ()
        :precondition (and 
            (= (n_card_in_hand) 7)
            (is_drawing)
        )
        :effect (not (is_drawing))
    )

    (:action draw_final_card
        :parameters (?c1 - card)
        :precondition (and
            (top_deck_card ?c1)
            (is_bottom_card ?c1)
        )
        :effect (and
            (not (top_deck_card ?c1))
            (card_in_hand ?c1)
            (increase (n_card_in_hand) 1)
            (not (is_drawing))
            (deck_empty)
        )
    )

)

; problem
(define (problem easy)
    (:domain the_game)
    (:objects
        pile0 - pile
        c_min c3 c2 c4 - card
    )
    (:init
        (ascending_pile pile0)
        (top_pile_card pile0 c_min)
        (top_deck_card c3)
        (next_card_in_deck c3 c2)
        (next_card_in_deck c2 c4)
        (is_bottom_card c4)
        (= (n_card_in_hand) 0)
        (= (value c_min) 1)
        (= (value c3) 3)
        (= (value c2) 2)
        (= (value c4) 4)
    )
    (:goal
        (and
            (deck_empty)
            (= (n_card_in_hand) 0)
        )
    )
)

; plan
1. (draw_card c3 c2)
   deleted: (top_deck_card c3)
   added: (top_deck_card c2) (card_in_hand c3) (is_drawing)
   changed: (n_card_in_hand) from 0 to 1
   goals met: 0 of 2
2. (draw_card c2 c4)
   deleted: (top_deck_card c2)
   added: (top_deck_card c4) (card_in_hand c2)
   changed: (n_card_in_hand) from 1 to 2
   goals met: 0 of 2
3. (draw_final_card c4)
   deleted: (top_deck_card c4) (is_drawing)
   added: (card_in_hand c4) (deck_empty)
   changed: (n_card_in_hand) from 2 to 3
   goals met: 1 of 2
4. (play_card c2 pile0 c_min)
   deleted: (card_in_hand c2) (top_pile_card pile0 c_min)
   added: (top_pile_card pile0 c2)
   changed: (n_card_in_hand) from 3 to 2
   goals met: 1 of 2
5. (play_card c3 pile0 c2)
   deleted: (card_in_hand c3) (top_pile_card pile0 c2)
   added: (top_pile_card pile0 c3)
   changed: (n_card_in_hand) from 2 to 1
   goals met: 1 of 2
6. (play_card c4 pile0 c3)
   deleted: (card_in_hand c4) (top_pile_card pile0 c3)
   added: (top_pile_card pile0 c4)
   changed: (n_card_in_hand) from 1 to 0
   goals met: 2 of 2
